###############################################################################
# Created by write_sdc
###############################################################################
current_design openframe_project_wrapper
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name sys_clk_in -period 25.0000 [get_ports {gpio_in[38]}]
set_propagated_clock [get_clocks {sys_clk_in}]
###############################################################################
# Environment
###############################################################################
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
